---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintBaseColor
source: html/2780127a-7af7-26fb-0e0a-9574162a784b.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintBaseColor Property

The property labeled "Color" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintBaseColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.